# Опыт и Новые уровни

Как таковой опыт в Ривер отсутствует и используется система Вех или Майлстоунов (Milestones), называемая **Подъем**. **Мастер** сам решает когда в его приключении должна наступить эта самая Веха при достижении которой игроки получают **3 очка подъема**, которые они могут распределить между своими [подходами](pers_detail_p), [архетипами](pers_aspects_1), [аспектами](pers_aspects_2) и [могуществом](magic_might).

При этом, для повышения значения этих параметров, требуется вложить столько очков подъема, каково их новое значение. Так, чтобы получить новый **аспект** или **архетип** понадобится **1 очко подъема** (с 0 до 1), поднятие значения до 2 — **2 очка подъема**, до 3 — **3 очка подъема** и т.д.

Также **Мастер** может предложить выучить новые аспекты или архетипы, их освоение стоит **1 очко подъема** (с 0 до 1). Во время подъема игрок может перераспределить очки подъема вложенные в имеющиеся у него архетипы и перенести аспекты из одного архетипа в другой, если это не противоречит логики архетипа.

> _**Пример**: Миравейн примкнула к последователям темного бога Магоса после последней вылазки в Диколесье. Теперь на подъеме она может получить новый архетип Последователь Магоса и взять несколько аспектов к нему. Также она вправе перераспределить очки подъема вложенные в уже имеющиеся архетипы, чтобы сделать новый архетип более эффективным._

**Мастер** может выдать игрокам черты как поощрения за их действия или предложить купить черту за очки подъема. Черту можно оплатить сразу или постепенно, но работать она будет только после того как будет оплачена полная цена. Стоимость таких черт может варьироваться от 1 **очка подъема** до 4, в зависимости от их полезности.
