# Направления усиления заклинания

Мы обсудили выше семь направлений усиления заклинаний, которые игрок может использовать с помощью могущества своего персонажа. Продвигаясь по ступеням, вы получаете **помеху** (1) за каждый сдвиг. Вы можете компенсировать каждую такую **помеху** доступной ячейкой **могущества**.

> **Помните**: Если **могущества** больше, чем помех от шкал магии, то оставшееся могущество **не преобразуется** в **преимущества**! Так же оно **не может** покрывать **помехи** от других источников!

## Поддержание заклинания

Позволяет заклинателю сотворять заклинание, если на данный момент уже есть действующие заклинание. Такое может произойти, если для первого заклинания использовалась длительность. Заклинатель может развеять поддерживаемое заклинание в любой момент, тем самым избавившись от необходимости получать дополнительную **помеху**. Максимально заклинатель может поддерживать до двух заклинаний, сотворяя третье, поэтому в этой шкале две ступени.

- **Второе заклинание** — заклинатель может сотворить второе заклинание, пока не истекло действие первого, получив **помеха** (1).
- **Третье заклинание** — заклинатель может сотворить третье заклинание, пока не истекло действие первых двух, получив **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.

> _**Пример**: Кайрон Ненасытный пригвоздил гоблина к стене огненным копьем с эффектом длительности и намерен как следует этого гоблина прожарить! В добавок к  другим помехам Кайрон получит **помеха** (1) за сотворение второго заклинания, пока поддерживает огненное копье._

## Изменение

Позволяет заклинателю изменять свойство элемента, с которой он взаимодействует. Например, цвет или температуру огня или плотность воды. Другой возможностью является управление сходной средой. Так, пиромант может управлять алхимическим огнем, аэромант дымом, а гидромант вином или кислотой.

Если заклинатель хочет, чтобы заклинание работало с его базовой материей его магической школы, то никаких **помех** не будет. Разберем ступени изменения подробнее:

- **Изменение характеристики материи** — заклинатель может изменить цвет, плотность, температуру и т.д, получив **помеха** (1).
- **Использование схожей среды** —  заклинатель может взаимодействовать с близкой по типу материей, получив **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.

## Длительность заклинания

Позволяет заклинателю накладывать не только мгновенные эффекты, но и длящиеся на протяжении некоторого времени, не заботясь об обновлении. Это называется **поддерживаемым** заклинанием.

Если заклинатель хочет, чтобы заклинание сработало мгновенно, то никаких **помех** не будет. Разберем временные отрезки подробнее:

- **От нескольких секунд до минуты или окончания сцены** — заклинатель может добиться такой продолжительности, получив **помеха** (1).
- **От нескольких минут до часа** —  заклинатель может добиться такой продолжительности, получив **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.
- **От нескольких часов до дня** — заклинатель может добиться такой продолжительности, получив **помеха** (3) — две **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **От нескольких дней до месяца** — заклинатель может добиться такой продолжительности, получив **помеха** (4) — три **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **От нескольких месяцев до года** — заклинатель может добиться такой продолжительности, получив **помеха** (5) — четыре **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **От нескольких лет до пока не будет развеяно или его выполнение не станет невозможным** — заклинатель может добиться такой продолжительности, получив **помеха** (6) — пять **помех** за предыдущие ступени и одну **помеху** за эту ступень.

> **Помните**: Так как время в Ривере находится под управлением Мастера, то именно он решает, когда эта минута или час закончились.

> _**Пример**: Заклинатель желает создать вокруг себя покров из ветра, наносящий урон всем, кто его коснулся в течение нескольких минут. В этом случае он получает  2 помехи от шкалы **Длительности**, и 1 помеху от шкалы **Формы**. У персонажа было три **могущества** и оно компенсировало все помехи, и изменение пула броска не произошло._

## Форма заклинаний

Позволяет заклинателю изменять форму заклинания, получая новые эффекты. Для некоторых заклинаний форма более важна, например для заклинаний сотворяющих предметы, для боевых заклинаний форма может давать дополнительные эффекты, которые **Мастер** может обсудить с игроком. Например, заклинание в форме копья может пригвоздить противника или пробить его насквозь, а полоса огня затруднить контратаку противника.

Если для заклинателя форма не имеет значение, то никаких помех не будет. Однако если эффект по мнению **Мастера** требует форму, то придется вложиться в эту шкалу. Разберем формы подробнее:

- **Простая геометрическая или природная форма** — сферы, цилиндры, кубы, полосы и т.д. или растительные формы, такие как корни, лозы, шипы, а также элементы животных форм - клыки, когти, роговые пластины, рога, щупальца, глаза, уши и т.д. Заклинатель может придать такую форму заклинанию, получив **помеха** (1).
- **Простая рукотворная или сложная природная форма** — орудия труда и быта, оружие, состоящие из одного или нескольких неподвижных элементов или облик живых существ, животных, чудовищ и гуманоидов. Заклинатель может придать такую форму заклинанию, получив **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.
- **Сложная рукотворная форма** — различные механизмы, имеющие подвижные части, или изделия со сложной формой, например ключи, знаки отличия или ювелирные украшения. Заклинатель может придать такую форму заклинанию, получив **помеха** (3) — две **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **Изящная форма** — божественные формы, поражающие сознание, или постоянно меняющие форму предметы. Такие формы повышают сложность заявки на 3. Заклинатель может придать такую форму заклинанию, получив **помеха** (4) — три **помехи** за предыдущие ступени и одну **помеху** за эту ступень.

> _**Пример**: Заклинатель с **тремя могуществами** желает создать огненный меч на несколько минут. В этом случае он получает 2 помехи от шкалы **Длительности** и 2 помехи от шкалы **Формы**, так как меч является простой рукотворной формой. По итогу игрок получит 1 **помеху** на свой бросок (из 4 **помех** нужно **вычесть** 3 **могущества**)._

## Дальность заклинания

Позволяет заклинателю воздействовать на цели или распространять эффекты своего заклинания на определенное расстояние. Если целей несколько, то расстояние считается до самой далекой цели.

Если заклинатель может дотянуться до цели, то никаких **помех** не будет. Разберем дистанции подробнее:

- **Близко** — если заклинатель хочет достать заклинанием цель на этой дистанции, то он получает **помеха** (1).
- **Далеко** — если заклинатель хочет достать заклинанием цель на этой дистанции, то он получает **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.
- **Видимость** — если заклинатель хочет достать заклинанием цель на границе видимости или наблюдаемой через другие объекты, то он получает **помеха** (3) — одну **помеху** за первую ступень и две **помехи** за предыдущие ступени.
- **Мистическая связь** — если заклинатель хочет достать заклинанием цель с которой его связывает что-то необычное, то он получает **помеха** (4) — одну **помеху** за первую ступень и три **помехи** за предыдущие ступени. Эта дистанция требует повествовательного обоснования и одобрения **Мастера**.

> _**Пример**: Заклинатель с **тремя могуществами** хочет поразить огненным сгустком гоблина, бегущего навстречу на дистанции **далеко**. В этом случае он получает 2 **помехи** от шкалы **Дальности**. По итогу игрок не получает помех на свой бросок (из 2 **помех** нужно вычесть 3 **могущества**). _

## Группа целей

Позволяет заклинателю воздействовать более чем на одну цель, вложив могущество в группу целей. В этом случае сложность и эффективность зависит от наличия перевеса у противника [перевеса](massive2). Если заклинание воздействует на несколько целей с разной сложностью, то **Мастер** должен установить итоговую сложность по самой высокой из них. Под целями понимаются живые существа или части их (если монстры огромны), а также отдельные предметы. Так например ящик это цель, а груда ящиков таковой не является.

Если заклинатель поражает одну цель, то никаких **помех** не будет. Разберем ступени этой шкалы подробнее:

- **От двух до трех целей** — если заклинатель хочет поразить такое количество целей, то он получает **помеха** (1).
- **Малая группа целей** — больше трех, но все еще немного (до 8-9  целей). Если заклинатель хочет поразить такое количество целей, то он получает **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.
- **Большая группа целей** — это уже отряд за десяток человек, но все еще не толпа. Если заклинатель хочет поразить такое количество целей, то он получает **помеха** (3) — две **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **Видимость** — все кто попадают в область видимости заклинателя и кого он считает целями. Если заклинатель хочет поразить такое количество целей, то он получает **помеха** (4) — три **помехи** за предыдущие ступени и одну **помеху** за эту ступень.

> _**Пример**: Заклинатель с **4 могуществами** хочет поразить каменными шипами крупный отряд орков, наступающих на форт на дистанции **далеко**. В этом случае он получает 2 **помехи** от шкалы **Дальности**, 1 **помеху** от шкалы **Формы** и 3 помехи от шкалы **Группа целей**. По итогу игрок получает 2 помехи на свой бросок (из 6 **помех** нужно вычесть 4 **могущества**). _

## Область заклинания

Позволяет заклинателю распространять эффекты заклинания целые области, делая целями всех находящихся внутри. Если заклинатель находится внутри области, то дальность учитывать не нужно, если заклинатель находится вне области, то дальность учитывается до границы области. Если область на которое воздействует большая, то нужно учитывать **масштаб**, из-за чего сложность может возрасти.

Если заклинатель поражает одну цель, то никаких **помех** не будет. Разберем ступени этой шкалы подробнее:

- **Небольшое пространство** — пространство объемом с человека. Если заклинатель хочет взаимодействовать с областью такого размера, то он получает **помеха** (1).
- **Замкнутое пространство** — например коридор, тронный зал, поляна или двор и т.д. Замок в этом случае не является одним пространством, так как состоит из множества отдельных комнат. Если заклинатель хочет взаимодействовать с областью такого размера, то он получает **помеха** (2) — одну **помеху** за первую ступень и одну **помеху** за эту ступень.
- **Естественная граница** —  замковая площадь, поле, дом или целый замок. Если заклинатель хочет взаимодействовать с областью такого размера, то он получает **помеха** (3) — две **помехи** за предыдущие ступени и одну **помеху** за эту ступень.
- **Область видимости** —  все, что попадает в область видимости заклинателя. Если заклинатель хочет взаимодействовать с областью такого размера, то он получает **помеха** (4) — три **помехи** за предыдущие ступени и одну **помеху** за эту ступень.

> _**Пример**: Заклинатель с **тремя могуществами** желает ослепить сгустком света большую группу гоблинов, находящихся на поляне. Так как поляна является  замкнутым пространством и заклинатель находиться в ней, то он получает 2 помехи от шкалы **Область**. По итогу игрок не получает помех на свой бросок (из 2 **помех** нужно вычесть 3 **могущества**). _

## Эффективность магии

Как и в случае с оружием, поражение противника заклинаниями продвигает сцену боевого столкновения. Эффективность в данном случае зависит не от могущества заклинателя, а от эффекта магии и формы, которую ей придали. Так например огонь имеет среднюю эффективность, а свет не эффективен вовсе, если не придать ему форму. Последнее слово тут остается за **Мастером**, но и игрок должен быть осведомлен о возможностях, которыми обладают эффекты.

Если магия используется в боевых столкновениях, то вы можете опираться на правила эффективности, написанные в этом разделе.
